backend/stress-test.yml
config:
  target: "http://localhost:3000"
  plugins:
    ensure: {} # Falla automáticamente el proceso si no se cumplen los acuerdos de nivel de servicio (SLA)
  ensure:
    thresholds:
      - "http.response_time.p99": 200 # El 99% de las transacciones debe procesarse en < 200ms
    maxErrorRate: 1 # No se permite más del 1% de caídas del socket HTTP
  phases:
    - duration: 20
      arrivalRate: 5
      name: "1. 🧪 Fase de Calentamiento (Tráfico Base)"
    - duration: 30
      arrivalRate: 15
      rampTo: 50
      name: "2. 🧪 Fase de Saturación Máxima (Pico de Carga)"

scenarios:
  - name: "Inundación transaccional perimetral (Payloads Mixtos Zod)"
    flow:
      # Flujo A: Datos Correctos -> Evalúa la tubería completa refactorizada
      - post:
          url: "/api/v1/employees"
          json:
            nombre: "Andrés Mendoza"
            cargo: "Software Architect"
            departamento: "I+D"
            sueldo: 4200
          capture:
            json: "$.data.id"
            as: "employeeId"
      - think: 1
      # Flujo B: Datos Corruptos -> Evalúa el rechazo inmediato y óptimo del DTO Zod
      - post:
          url: "/api/v1/employees"
          json:
            nombre: "Al"
            cargo: "Dev"
            departamento: "TI"
            sueldo: -500 # Campo ilegal